Revit 2027 API
ParameterTypeId.BoundaryDirectionZ Property
 "Z Translation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryDirectionZ { get; }
Public Shared ReadOnly Property BoundaryDirectionZ As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryDirectionZ {
	ForgeTypeId^ get ();
}
static member BoundaryDirectionZ : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace